hse_full = """Системное представление проекта. Прямые и обратные связи в проекте. Точки бифуркации 
и аттрактор. Типы систем “cynefin”. Энтропия и негэнтропия. Закон необходимого 
разнообразия. Описание проекта как системы. Иерархия в системе проекта. Метасистема и 
подсистемы в проекте. Функциональное и информационное описание проекта. Системное представление проекта. Прямые и обратные связи в проекте. Точки бифуркации 
и аттрактор. Типы систем “cynefin”. Энтропия и негэнтропия. Закон необходимого 
разнообразия. Описание проекта как системы. Иерархия в системе проекта. Метасистема и 
подсистемы в проекте. Функциональное и информационное описание проекта. Жизненный цикл и фазы жизненного цикла проекта. Расширенный жизненный цикл 
проекта. Процессы управления проектом. Функциональные области управления проектом. 
Процессы и функциональные области. Организация проекта. Организация по методу 
«стадия-ворота». Общий подход к определению проекта. Управление предметной областью (содержанием) 
проекта. Построение иерархической структуры работ. Контрольные точки (вехи) проекта. 
Управление изменением содержания (предметной области) проекта Содержание командной организации и типы команд. Модель формирования и развития 
команды проекта. Организация функционирования эффективных команд. Управление 
производительностью команды проекта. Лидерство в проекте. Состав временных параметров и взаимосвязи работ. Графические построения и 
количественная оценка временных параметров. Методика PERT и метод критического 
пути. Метод критической цепи. Оптимизация расписания проекта. Планирование 
денежных затрат и проекта. Понятие и концепции качества. Процессы управления качеством. Инструменты 
управления качеством. Стандарт по управлению качеством проекта.
"""

hse = """Системный подход в управлении проектами Стратегическая система управления проектами Процессы и функциональные области 
управления проектами Определение и предметная область проекта Управление человеческими ресурсами 
(командой) проекта Планирование проекта по временным и 
стоимостным параметрам Управление качеством проекта Управление рисками проекта Управление коммуникациями и стейкхолдерами 
проекта Оценка исполнения проекта Гибкое управление проектами Стандарты и корпоративная система управления"""

imcsn = """
Основы управления проектами
Руководство проектами как особый вид управления
Управление временем проекта 
Маркетинг проекта
Организационные структуры управления проектами
Управление командой проекта
Управление финансами проекта
Проектное финансирование и управление рисками
Управление качеством проектов
Завершение проекта и роспуск команды
"""

imcsn_full = """ 
Определение проекта, его признаки и основные характеристики. Концепция управления
проектами. Классификация типов проектов. Цель, стратегия и результат проекта. Окружение
проектов. Участники проекта
Разработка концепции проекта. Методы управления проектами. Основные положения
управления проектами. Жизненный цикл проекта. Проектные циклы. Особенности процессов
управления проектами
Планирование проекта. Структура разбиения работ (СРР). Определение основных вех.
Назначение ответственных за проект. Столбиковые диаграммы или график Ганта. Сетевое
планирование. Целеполагание и определение ресурсов проекта. Связь сметного и
календарного планирования
Планирование проекта. Структура разбиения работ (СРР). Определение основных вех.
Назначение ответственных за проект. Столбиковые диаграммы или график Ганта. Сетевое
планирование. Целеполагание и определение ресурсов проекта. Связь сметного и
календарного планирования
Современная концепция маркетинга в управлении проектами. Маркетинговые исследования.
Разработка маркетинговой стратегии проекта. Программа маркетинга проекта. Бюджет
маркетинга проекта. Реализация маркетинга проекта. Управление маркетингом в рамках
управления проектами
Организационная структура проекта и его внешнее окружение. Общая последовательность
разработки и создания организационных структур управления проектами. Типы
организационных структур управления проектами. Современные методы и средства
организационного моделирования проектов.
Участники проекта и их роли. Эффективная проектная команда. Оценка эффективности
команды. Формирование команды. Мотивы и стимулы. Команда и руководитель. Типы общения
в процессе реализации проектов.
Общее понятие и особенности проектного финансирования. Виды проектного
финансирования: параллельное и последовательное финансирование. Виды
финансирования: собственные, заемные и привлеченные средства. Методы финансовой
оценки проекта. Расходы и бюджетирование проекта
Основные понятия управления рисками проектов. Проектные риски. Методы анализа рисков.
Управление рисками. Риск и неопределенность, предположительная оценка и калькуляция.
Качественный анализ рисков. Количественный анализ рисков. Внешние и внутренние факторы
воздействия на проект. Методы снижения рисков проектов
Современная концепция управления качеством. Общие требования к системам менеджмента
качества. Сертификация систем менеджмента качества. Экологический менеджмент.
Правовые аспекты экологического менеджмента на территории России.
Роль мониторинга в общей системе управления проектами. Мониторинг и управление рисками.
Рекомендации по завершению проекта. Окончание проекта. Завершение работ и роспуск
команды. Проверки проекта. Постпроектная оценка.
"""

hsmi_full = """Общее определение проекта; признаки 
проекта. Рычаги управления. Законы в 
управлении проектами. Функции и 
подсистемы управления проектами. 
Интеграция проекта. Ключевые понятия 
проекта. Цели проекта, продукт и результат 
проекта, границы проекта, стратегический 
план. План по вехам. Жизненный цикл и фазы 
управления проектом. Базовые жизненные 
циклы проектов различного типа. Этапы 
проекта разработки нового изделия, 
инвестиционного проекта. Особенности 
управления инновационными проектами. Инициация проекта и этапа. Паспорт проекта. 
Обоснование проекта. Подготовка описания 
продукта, обоснования проекта. Разработка 
плана проекта. Структура плана проекта. 
Взаимосвязь проектного и процессного 
подходов. Использование инструментов 
процессного подхода для подготовки 
обоснования проекта. Примеры бизнес процессов Идентификация и оценка рисков проекта, 
разработка реагирования. Контрольные формы 
идентификации рисков. Способы 
противодействия рискам. Завершение проекта: закрытие контрактов, 
административное завершение. Подведение 
итогов проекта. Карточка административного 
завершения. Мотивация и стимулирование 
команды проекта. Принципы премирования Типы структур: функциональные, матричные, 
проектные. Влияние структуры на процесс 
управления проектом. Проектная организация 
работы компании. Организационная структура 
проектно-ориентированной компании. 
Управление ресурсами компании. Совместное 
использование ресурсов. Офис управления 
проектами. Проектный комитет. Взаимосвязь проектного и процессного 
подходов. Правила описания бизнес процессов. Матрица входов-выходов. 
Показатели процесса. Обеспечение снижения 
требований к квалификации персонала. Использование шаблонов документов. 
Примеры бизнес-процессов. Управление проектами как инструмент 
достижения стратегических и тактических 
целей компании. Портфели проектов. 
Совместная реализация проектов с учетом 
ограничений.
"""